{
  "architectures": [
    "ForCausalLM"
  ],
  "boa_token_id": 256000,
  "boi_token_id": 255999,
  "dtype": "bfloat16",
  "eoa_token_id": 258883,
  "eoa_token_index": 258883,
  "eoi_token_id": 258882,
  "eos_token_id": [
    1,
    106
  ],
  "initializer_range": 0.02,
  "model_type": "gemma4",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": false,
    "bos_token_id": 2,
    "dtype": "bfloat16",
    "enable_moe_block": false,
    "eos_token_id": 1,
    "expert_intermediate_size": null,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 1536,
    "hidden_size_per_layer_input": 256,
    "initializer_range": 0.02,
    "intermediate_size": 6144,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 131072,
    "model_type": "gemma4_text",
    "num_attention_heads": 8,
    "num_experts": null,
    "num_global_key_value_heads": null,
    "num_hidden_layers": 35,
    "num_key_value_heads": 1,
    "num_kv_shared_layers": 20,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 512,
    "tie_word_embeddings": true,
    "top_k_experts": null,
    "use_bidirectional_attention": null,
    "use_cache": true,
    "use_double_wide_mlp": true,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0.dev0",
  "quantization": {
    "bits": 5,
    "group_size": 64,
    "gate_proj": {
      "bits": 4,
      "group_size": 64
    },
    "up_proj": {
      "bits": 4,
      "group_size": 64
    },
    "down_proj": {
      "bits": 4,
      "group_size": 64
    },
    "embed_tokens_per_layer": {
      "bits": 3,
      "group_size": 64
    },
    "per_layer_input_gate": {
      "bits": 4,
      "group_size": 64
    },
    "per_layer_projection": {
      "bits": 4,
      "group_size": 64
    },
    "embed_tokens": {
      "bits": 3,
      "group_size": 64
    },
    "lm_head": {
      "bits": 3,
      "group_size": 64
    }
  },
  "quantization_config": {
    "group_size": 64,
    "bits": 3,
    "mode": "affine"
  }
}